In [1]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [2]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv('cast.csv', sep=",")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [4]:
len(titles)

232330

### What are the earliest two films listed in the titles dataframe?

In [5]:
titles.sort_values('year').head(2)

                     title  year
177757          Miss Jerry  1894
215272  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [6]:
fil_hamlet = (titles['title'] == 'Hamlet')
len(titles[titles['title'] == 'Hamlet'])

18

### How many movies are titled "North by Northwest"?

In [7]:
fil_norbnor = titles['title'] == 'North by Northwest'
len(titles[fil_norbnor])

1

### When was the first movie titled "Hamlet" made?

In [8]:
titles[fil_hamlet].sort_values('year').head(1)

        title  year
46721  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [9]:
fil_treaisl = titles['title'] == 'Treasure Island'
titles[fil_treaisl].sort_values('year')

                  title  year
206027  Treasure Island  1918
51287   Treasure Island  1920
191050  Treasure Island  1934
96934   Treasure Island  1950
89534   Treasure Island  1972
111343  Treasure Island  1973
205397  Treasure Island  1985
179354  Treasure Island  1999

### How many movies were made in the year 1950?

In [10]:
fil_yr1950 = titles['year'] == 1950
len(titles[fil_yr1950])

1099

### How many movies were made in the year 1960?

In [11]:
fil_yr1960 = titles['year'] == 1960
len(titles[fil_yr1960])

1501

### How many movies were made from 1950 through 1959?

In [12]:
fil_yr1950_59 = (titles['year'] >= 1950) & (titles['year'] <= 1959)
len(titles[fil_yr1950_59])

12711

### In what years has a movie titled "Batman" been released?

In [13]:
fil_batman = titles['title'] == 'Batman'
titles[fil_batman]

        title  year
56000  Batman  1989
74608  Batman  1943

### How many roles were there in the movie "Inception"?

In [14]:
fil_incep = cast['title'] == 'Inception'
len(cast[fil_incep])

77

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [15]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [16]:
len(cast[fil_incep].isnull())

77

### But how many roles in the movie "Inception" did receive an "n" value?

In [17]:
len(cast[fil_incep].notnull())

77

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [18]:
cast[(cast['title'] == 'North by Northwest') & (cast['n'].notnull())].sort_values('n')

,title,year,name,type,character,n
845516,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3382934,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1413409,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3043261,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
345822,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2941468,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1644542,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1236791,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2372617,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1757154,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
646039,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2225858,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
450691,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1463316,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
199768,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1343025,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [19]:
cast[(cast['title'] == 'Sleuth') & (cast['year'] == 1972)].sort_values('n')

,title,year,name,type,character,n
1654402,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
316652,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
362592,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1421434,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2635708,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1405219,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [20]:
cast[(cast['title'] == 'Sleuth') & (cast['year'] == 2007)].sort_values('n')

          title  year                 name     type          character    n
316653   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1254632  Sleuth  2007             Jude Law    actor               Milo  2.0
1751872  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
251883   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
362593   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2635707  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3244050  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [21]:
len(cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1921)])

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [22]:
len(cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1996)])

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [23]:
len(cast[cast['character'] == 'Hamlet'].name.unique())

92

### How many people have played an "Ophelia"?

In [24]:
len(cast[cast['character'] == 'Ophelia'].name.unique())

109

### How many people have played a role called "The Dude"?

In [25]:
len(cast[cast['character'] == 'The Dude'].name.unique())

18

### How many people have played a role called "The Stranger"?

In [26]:
len(cast[cast['character'] == 'Stranger'].name.unique())

276

### How many roles has Sidney Poitier played throughout his career?

In [27]:
len(cast[cast.name == 'Sidney Poitier'].character)

43

### How many roles has Judi Dench played?

In [28]:
len(cast[cast.name == 'Judi Dench'].character)

54

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [29]:
cast[(cast.name == 'Cary Grant') & (cast.year == 1940) & (cast.n == 2)].sort_values('year')

                   title  year        name   type   character    n
845513  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [30]:
cast[(cast.name == 'Cary Grant') & (cast.year == 1940) & (cast.n == 1)].sort_values('year')

,title,year,name,type,character,n
845495,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
845539,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
845541,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s?

In [31]:
len(cast[(cast.type == 'actor') & (cast.year // 10 == 195)])

155058

### How many roles were avilable for actresses in the 1950s?

In [32]:
len(cast[(cast.type == 'actress') & (cast.year // 10 == 195)])

56412

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [33]:
len(cast[(cast.n == 1) & (cast.year <= 1980)])

64095

### How many non-leading roles were available through from the beginning of film history through 1980?

In [34]:
len(cast[(cast.n != 1) & (cast.year <= 1980)])

1097484

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [35]:
len(cast[cast.n.isnull() & (cast.year <= 1980)])

439134